{
  "meta": {
    "description": "Hi, ich bin Manuel. Ein leidenschaftlicher JavaScript Entwickler aus München. Hier findest du neben meinem bisherigen Werdegang auch Informationen zu meinen Projekten und Auszüge aus meinem Leben im Blog."
  },
  "global": {
    "sendMail": "E-Mail senden",
    "githubLink": "Zum GitHub Projekt",
    "projectLink": "Zum Projekt",
    "moreInformation": "Mehr Infos",
    "months": [
      "Jan", "Feb", "Mär", "Apr",
      "Mai", "Jun", "Jul", "Aug",
      "Sep", "Okt", "Nov", "Dez"
    ],
    "dateFormat": "%{month} %{year}",
    "dateFormatLong": "%{date}. %{month} %{year}",
    "dateExtension": ".",
    "loading": "Einen Augenblick ..."
  },
  "nav": {
    "about": "Über mich",
    "projects": {
      "projects": "Projekte",
      "feader": "feader",
      "housemaid": "Housemaid"
    },
    "resume": "Lebenslauf",
    "blog": "Blog"
  },
  "home": {
    "meta": {
      "title": null,
      "description": null
    },
    "job": "JavaScript Entwickler",
    "more": {
      "title": "Mehr von mir",
      "blog": "Blog lesen",
      "projects": "Projekte anzeigen",
      "resume": "Lebenslauf ansehen",
      "jsguys": "Zu den jsguys",
      "verlagsprofis": "Zu den Verlagsprofis"
    },
    "welcome": {
      "title": "Willkommen auf meiner Website",
      "text": [
        "Hi, auf meiner Website findest du viele Informationen über mich, meine Interessen und Hobbies. Falls du dich mehr für meine berufliche Laufbahn interessierst, nimm meinen Lebenslauf und die Open Source Projekte genauer unter die Lupe. Sieh dich um und lies dir auch meinen Blog durch, der alle meiner mir wichtigen Interessen abdeckt und dich mit unterhaltsamen Artikeln zu einer Vielzahl verschiedener Themen versorgt. Falls noch Fragen offen bleiben oder du mich aus kontaktieren möchtest, kannst du dies jederzeit gerne über die aufgelisteten sozialen Netzwerke oder per E-Mail tun.",
        "Aber fang doch einfach am Anfang an:"
      ]
    },
    "jsguys": {
      "text": "Besuche auch die Website der von Maik Paulus und mir gegründeten jsguys. Hier kannst du unseren Blog nach den neuesten Technologien und weiteren spannenden Themen im JavaScript-Universum durchstöbern. Mach dich mit unseren aktuellen Projekten vertraut, Anfragen zu Aufträgen oder anderen Themen sind jederzeit willkommen!",
      "link": "jsguys.net besuchen"
    }
  },
  "about": {
    "meta": {
      "title": "Über mich",
      "description": "Hier geht's nur um mich :)"
    },
    "title": "Hi, ich bin Manuel.",
    "text": [
      "Ich bin ",
      " Jahre alt und lebe in München. Seit dem Abschluss meines ",
      "Informatik",
      " Studiums an der Hochschule für angewandte Wissenschaften München arbeite ich als Entwickler. Die letzten drei Jahre erweiterte ich mein Wissen im Webbereich – besonders ",
      ". Ich liebe es, Tools mit ",
      " und dem ",
      "MEAN-Stack",
      " zu entwickeln, da er ein schlankes Design aufweist und die Stärken von ",
      " im Backend und Frontend aufweist.",

      "Neben dem Programmieren laufe ich so oft wie möglich und fahre mit dem Mountainbike, falls das mal nicht geht. Aktuell trainiere ich für meinen ersten Marathon in Berlin Ende des Jahres. Ich interessiere mich für Architektur und habe ein Faible für Clean Design und die damit verbundene Schönheit der Einfachheit moderner UI.",

      "Meine Leidenschaft ist das Reisen um die Welt, um verschiedene Länder und deren Kulturen kennen zu lernen. Der Blog auf dieser Website spiegelt diesen bunten Mix aus Reisen, Sportevents und Coding-Themen wider und gibt dir ein paar Einblicke in meine Welt!"
    ],
    "numbers": {
      "title": "Mein Jahr in Zahlen",
      "sections": [
        "Bundesverdienstkreuze",
        "Läufe",
        "Tassen Kaffee"
      ]
    },
    "jsguys": {
      "text": [
        "Als Mitgründer des zweiköpfigen Teams ",
        " habe ich zusammen mit ",
        " die Vision, die Welt moderner Webanwendungen zu verändern. Wir sind davon überzeugt, dass JavaScript und Node.js weit mehr als nur weiterere Webtechnologien sind und dass es in Zukunft noch viel mehr mit ihnen zu entdecken gibt. Wenn auch du dieser Meinung bist, folge uns auf ",
        ", bleibe mit unserem ",
        "Blog",
        " immer auf dem Laufenden und mach dich mit unseren Projekten auf ",
        " vertraut.",
        "Du möchtest mehr über uns und unsere Arbeit herausfinden? Dann besuche unsere Website mit mehr Projekten und detailierten Informationen auf "
      ]
    }
  },
  "blog": {
    "meta": {
      "title": "Blog",
      "description": "In meinem Blog dreht sich alles um Laufen, Reisen sowie Webentwicklung mit JavaScript und Node.js."
    },
    "preview": {
      "more": "weiterlesen"
    },
    "title": "Blog",
    "error": {
      "title": "Content ist King!",
      "text": [
        "Leider konnten die Posts nicht geladen werden, da die Inhalte derzeit nicht verfügbar sind. Bitte versuche es in ein paar Minuten noch einmal!"
      ]
    },
    "tags": {
      "travel": "Reisen",
      "development": "Entwicklung",
      "sport": "Sport",
      "running": "Laufen"
    },
    "share": {
      "title": "Post teilen",
      "facebook": "hat gerade einen interessanten Post gelesen",
      "linkedin": "Ich kann diesen Post empfehlen",
      "mail": "Hi,\ndiesen Post kann ich nur empfehlen: %{link}",
      "twitter": "Hier ein interessanter Post:",
      "xing": "Ich kann diesen Post empfehlen"
    },
    "subscribe": {
      "headline": "Blog abonnieren",
      "text": [
        "Verpasse keinen Post mehr!"
      ],
      "button": "Abonnieren",
      "email": "E-Mail-Adresse"
    },
    "notFound": {
      "title": "Post nicht gefunden",
      "text": [
        "Unter der angegebenen URL konnte kein Post gefunden werden. Geh bitte zurück zur Übersicht und öffne einen Post aus der Liste."
      ],
      "back": "Zurück zur Übersicht"
    }
  },
  "projects": {
    "meta": {
      "title": "Projekte",
      "description": "Eine kurze Liste meiner bisherigen Projekte und die der jsguys und Verlagsprofis, die in meiner Freizeit entstanden sind."
    },
    "feader": {
      "meta": {
        "title": "feader",
        "description": null
      },
      "text": [
        "feader wurde zum Thema meiner Bachelorarbeit und steht nun in einer abgespeckten Version auf GitHub zur Verfügung. Das Projekt brachte einen Feedreader für RSS und Atom Feeds hervor, der nach dem Ende des Google Readers entstand.",
        "Im Gegensatz zur Konkurrenz sollte sich feader durch Datenschutz nach deutschem Recht und ein schlichtes und modernes Design behaupten.",
        "Das Projekt was mein erstes mit PHP und diente nicht zuletzt zum Experimentieren. Nach kurzer Zeit wurden einige Studenten darauf aufmerksam und der Dienst konnte nach einer Woche rund 100 Nutzer verzeichnen.",
        "Die auf dem Zend Framework basierende Plattform setzte auf MySQL und einen in C++ implementierten Crawler zum Aktualisieren der Feeds.",
        "Nach dem Ende der Bachelorarbeit und dem Beginn als Vollzeitentwickler wurde das Projekt jedoch leider zu zeitintensiv, um es ohne die Einführung eines Abomodells weiter zu führen und wurde ab da auf GitHub veröffentlicht."
      ]
    },
    "housemaid": {
      "meta": {
        "title": "Housemaid",
        "description": null
      },
      "text": [
        "Housemaid befindet sich derzeit in einem sehr frühen Stadium und verfügt nur über den ursprünglich angedachten Funktionsumfang, der Anzeige verpasster Anrufe.",
        "Ausgangspunkt war ein Fehler, der meinem Telefon den Abruf von verpassten Anrufen von meinem Router untersagte. Die Software läuft derzeit auf einem Raspberry π und ruft die aktuellen Anrufdaten vom Router ab. Nach einem initialen Abruf zur Festlegung der bereits vorhandenen Kommunikationsdaten wird jeder neu erfasste Datensatz auf einem kleinen 20x2 LCD angezeigt.",
        "Geplant ist über dieses Modul hinweg der Aufbau eines Systems, das mit einem Leap Motion Controller gesteuert werden kann und aus einer variablen Anzahl an Modulen mit unterschiedlichen Einsatzgebieten besteht. Eines davon ist das Modul verpasster Anrufe.",
        "Durch Wischgesten kann das Modul gewechselt, zu einer anderen Seite innerhalb eines Moduls gesprungen oder eine Aktion ausgeführt werden.",
        "Folgende Module sind derzeit in der Entwicklung oder in der Ideenphase:"
      ],
      "features": [
        "Verwaltung der Geräte im WLAN",
        "Gäste-WLAN, das mittels MAC-Adresse neue Geräte zur Freigabe vermerkt, um sie zum Heimnetzwerk hinzuzufügen. Durch Anmeldung auf Facebook kann der Vorgang über eine bestehende Freundschaft auch automatisiert werden.",
        "U-Bahn-Plan ab der Haustür",
        "Wettervorhersage",
        "Heizungssteuerung",
        "Einbinden von Kontaktdaten aus der Cloud zur Anzeige bei Anrufen",
        "Anzeige von Kalenderevents des heutigen Tages"
      ]
    },
    "moreInformation": "Mehr Infos",
    "githubLink": "Zum GitHub Projekt",
    "own": {
      "title": "Eigene Projekte",
      "housemaid": {
        "text": [
          "Ein auf",
          "aufbauendes System, das alle Informationen für das Digital Home zusammentragen und aufbereiten soll."
        ]
      },
      "feader": {
        "text": [
          "Ein webbasierter responsive Feedreader, dessen Hauptaugenmerk auf Datenschutz und Benutzerfreundlichkeit liegt."
        ]
      }
    },
    "jsguys": {
      "link": "Zu den jsguys",
      "text": [
        ""
      ],
      "beerific": {
        "text": [
          "Beerific ist eine mit",
          "entwickelte App für iOS und Android, die das Auffinden von Biergärten im Großraum München sowie das Finden von Freunden am Treffpunkt vereinfacht und den Feierabend lebenswert macht."
        ]
      },
      "presentation": {
        "text": [
          "Eine Präsentationssoftware, die in",
          "implementiert wurde und auf dem",
          "MEAN-Stack",
          "aufbaut. Presentation schafft die Notwendigkeit eines Beamers ab und bringt die Präsentation auf das Smartphone oder den Rechner der Teilnehmer, die dann interaktiv an dieser teilnehmen können."
        ]
      }
    },
    "verlagsprofis": {
      "link": "Zu den Verlagsprofis",
      "text": [
        "Die Verlagsprofis helfen Verlägen dabei, anfallende Schwierigkeiten durch digitale Innovation zu beseitigen. Derzeit arbeiten wir an einem Tool zur einfachen Bewältigung des EBV (elektronisches Bestätigungsverfahren). In Kürze werden weitere Anwendungsbereiche folgen und das Angebot für alle Verläge verfügbar sein."
      ]
    },
    "more": {
      "title": "Du hast noch nicht genug?",
      "text": [
        "Weitere interessante Projekte sind unterwegs und werden bald hier verfügbar sein!",
        "Die neuesten Updates kannst du am besten auf meinem",
        "Account sehen!"
      ]
    }
  },
  "resume": {
    "meta": {
      "title": "Lebenslauf",
      "description": "Hier erfährst du mehr über meine berufliche Laufbahn."
    },
    "since": "Seit",
    "location": "in %{city}",
    "experience": {
      "title": "Berufserfahrung",
      "ff": {
        "job": "Web- & Datenbankentwickler",
        "city": "München",
        "text": [
          "Implementierung interner",
          "Tools mit",
          "und",
          ". Weiterhin gehört zu meinen Aufgaben die Sicherstellung der Codequalität, automatische Tests und technisches Projektmanagement.",
          "Das Backend wurde in",
          "realisiert und basiert auf dem MVC-Pattern und unterschiedlichen Frameworks in Verbindung mit einer Oracle Datenbank."
        ]
      },
      "keks": {
        "job": "Java & iOS Entwickler (Werkstudent)",
        "city": "München",
        "text": [
          "Entwicklung einer Continuity App für iOS (",
          ") mit einem in",
          "geschriebenen Gegenstück, das auf reinem Raspberry Pi lief und für die Synchronisation von Video- und Audiodateien sowie Metadaten in Echtzeit zwischen Kameras, Soundgeräten und der iOS App war.",
          "Zusätzlich wurde ich mit der Weiterentwicklung der",
          "Firmware der Soundgeräte beauftragt, um sie mit der Synchronisation kompatibel zu machen und implementierte ein auf",
          "basierendes Konfigurationsinterface für den gesamten Synchronisationsprozess."
        ]
      },
      "mec": {
        "job": "Mobile App Entwickler (Werkstudent)",
        "city": "München",
        "text": [
          "In der anfänglich für das Praxissemester vorgesehenen Stelle konnte ich meine Erfahrung in der Entwicklung von ortungsbasierten iOS (",
          ") Apps erweitern. Daraus entstanden Apps für die Ortung von Geldautomaten, Tankstellen und Restaurants sowie weitere für externe Kunden, die sich unter anderem mit Urlaubsplanung und Routenberechnung befassten.",
          "Im Backend wurde eine",
          "Schnittstelle in",
          "implementiert."
        ]
      },
      "parker": {
        "job": "Hochseilgarten Trainer",
        "city": "Übersee a. Chiemsee & München",
        "text": [
          "Ausbildung zum Hochseilgarten Trainer. Neben der allgemeinen Betreuung von Kunden wurden auch Teamworking-Fähigkeiten erweitert. In zahlreichen Rettungsaktionen konnte die Bewältigung von Extremsituationen trainiert werden."
        ]
      }
    },
    "education": {
      "title": "Studium",
      "cs": {
        "title": "Informatik (B.Sc.)",
        "college": "Hochschule für angewandte Wissenschaften München",
        "text": [
          "Abschluss der Hochschule mit dem Bachelor of Science in Informatik."
        ]
      },
      "thesis": {
        "title": "Bachelorarbeit",
        "college": "Hochschule für angewandte Wissenschaften München",
        "text": [
          "Thema: Entwicklung des Feedreaders feader",
          "Für mehr Informationen sehen Sie sich die Projektseite an."
        ]
      }
    },
    "highlight": {
      "title": "Du bist dran!",
      "text": [
        "Habe ich dein Interesse geweckt und du möchtest mir eine passende Stelle anbieten oder wünschst weitere Informationen? Perfekt ist eine Position mit der Option, ein halbes bis ein Jahr remote zu arbeiten, um so die Welt zu bereisen und währenddessen tollen und effizienten Code zu schreiben. Schreib mir eine E-Mail oder kontaktiere mich über die aufgelisteten sozialen Netzwerke. Überzeug' mich!"
      ]
    },
    "skills": {
      "title": "Fähigkeiten",
      "programming": {
        "title": "Programmiersprachen"
      },
      "libs": {
        "title": "Frameworks & Libraries"
      },
      "db": {
        "title": "Datenbanken"
      },
      "others": {
        "title": "Sonstige",
        "pm": "Projektmanagement"
      }
    }
  },
  "contact": {
    "meta": {
      "title": "Kontakt"
    },
    "subline": "So kannst du mich erreichen",
    "text": [
      "Derzeit bin ich nur via E-Mail und soziale Netzwerke erreichbar."
    ]
  },
  "imprint": {
    "meta": {
      "title": "Impressum"
    },
    "owner": {
      "title": "Eigentümer nach § 5 TMG",
      "city": "München",
      "contact": {
        "title": "Kontakt",
        "phone": "Telefonnummer auf Anfrage"
      }
    },
    "disclaimer": {
      "title": "Haftungsausschluss",
      "content": {
        "title": "Interne Inhalte",
        "text": [
          "Die Inhalte meiner Website werden mit größter Sorgfalt erstellt. Für die Richtigkeit, Vollständigkeit und Aktualität der Inhalte kann ich jedoch keine Gewähr übernehmen. Als Diensteanbieter bin ich gemäß § 7 Abs.1 TMG für eigene Inhalte auf diesen Website nach den allgemeinen Gesetzen verantwortlich. Nach §§ 8 bis 10 TMG bin ich als Diensteanbieter jedoch nicht verpflichtet, übermittelte oder gespeicherte fremde Informationen zu überwachen oder nach Umständen zu forschen, die auf eine rechtswidrige Tätigkeit hinweisen. Verpflichtungen zur Entfernung oder Sperrung der Nutzung von Informationen nach den allgemeinen Gesetzen bleiben hiervon unberührt. Eine diesbezügliche Haftung ist jedoch erst ab dem Zeitpunkt der Kenntnis einer konkreten Rechtsverletzung möglich. Bei Bekanntwerden von entsprechenden Rechtsverletzungen werde ich diese Inhalte umgehend entfernen."
        ]
      },
      "links": {
        "title": "Externe Links",
        "text": [
          "Diese Website enthält Links zu externen Websites Dritter, auf deren Inhalte ich keinen Einfluss habe. Deshalb kann ich für diese fremden Inhalte auch keine Gewähr übernehmen. Für die Inhalte der verlinkten Seiten ist stets der jeweilige Anbieter oder Betreiber der Seiten verantwortlich. Die verlinkten Seiten wurden zum Zeitpunkt der Verlinkung auf mögliche Rechtsverstöße überprüft. Rechtswidrige Inhalte waren zum Zeitpunkt der Verlinkung nicht erkennbar. Eine permanente inhaltliche Kontrolle der verlinkten Seiten ist jedoch ohne konkrete Anhaltspunkte einer Rechtsverletzung nicht zumutbar. Bei Bekanntwerden von Rechtsverletzungen werde ich derartige Links umgehend entfernen."
        ]
      },
      "copyright": {
        "title": "Copyright",
        "text": [
          "Die durch den Seitenbetreiber erstellten Inhalte und Werke auf diesen Seiten unterliegen dem deutschen Urheberrecht. Die Vervielfältigung, Bearbeitung, Verbreitung und jede Art der Verwertung außerhalb der Grenzen des Urheberrechtes bedürfen der schriftlichen Zustimmung des jeweiligen Autors bzw. Erstellers. Downloads und Kopien dieser Website sind nur für den privaten, nicht kommerziellen Gebrauch gestattet. Soweit die Inhalte auf dieser Seite nicht vom Betreiber erstellt wurden, werden die Urheberrechte Dritter beachtet. Insbesondere werden Inhalte Dritter als solche gekennzeichnet. Solltest du trotzdem auf eine Urheberrechtsverletzung aufmerksam werden, bitte ich um einen entsprechenden Hinweis. Bei Bekanntwerden von Rechtsverletzungen werde ich derartige Inhalte umgehend entfernen."
        ]
      }
    }
  },
  "privacy": {
    "meta": {
      "title": "Datenschutz"
    },
    "ga": {
      "title": "Google Analytics",
      "text": [
        "",
        "Diese Website verwendet Google Analytics. Dies ist ein Dienst zur Analyse von Internetseiten der Google Inc. (\"Google\"). Google Analytics verwendet sogenannte Cookies. Die Cookies sind Dateien. Durch die Speicherung der Cookies auf deinem Computer kann Google deine Benutzung meiner Website analysieren. Diese Informationen und deine anonymisierte IP-Adresse werden an die Google-Server in den USA übermittelt und von diesen gespeichert.",
        "Google wertet die Informationen der Nutzung meiner Website aus. Damit werden Berichte zu deinen Aktivitäten auf meiner Seite erstellt und mir zugänglich gemacht. Dies kann auch der Möglichkeit dienen, weitere mit der Nutzung meiner Website oder der Nutzung des Internets verbundene Dienstleistungen anbieten oder erbringen zu können. Diese Informationen wird Google möglicherweise an Dritte weitergeben, wenn dies von Gesetzes wegen gefordert ist oder für den Fall, dass Dritte von Google beauftragt werden, diese Datenverarbeitung vorzunehmen. Keinesfalls wird Google jedoch deine IP-Adresse mit anderen Daten von Google verknüpfen.",
        "Du hast die Möglichkeit zu verhindern, dass die genannten Cookies auf deinem Computer gespeichert werden. Dazu musst du an deinem Browser eine dementsprechende Einstellung vornehmen. Allerdings besteht dann die Möglichkeit, dass meine Website für dich nur eingeschränkt nutzbar ist. Du kannst die Erfassung, den Versand und die Verarbeitung deiner Daten sowie deine IP-Adresse durch Google verhindern. Dazu kannst du ein Plugin für deinen Browser herunterladen und installieren. Dieses Plugin ist unter folgendem Link verfügbar:",
        "Alternativ dazu kannst du <a href=\"javascript:gaOptout()\">diesen Link</a> nutzen, um das Tracking durch Google Analytics zukünftig auf dieser zu deaktivieren (Dies gilt nur für den aktuell von dir genutzten Browser und die derzeitige Domain dieser Website)."
      ]
    }
  },
  "notFound": {
    "meta": {
      "title": "Seite nicht gefunden",
      "description": ""
    },
    "text": [
      "Heute ist nicht der Tag zum Schwimmen, ",
      "hier kommst du schneller ans Ziel:"
    ],
    "home": "Zur Startseite"
  },
  "footer": {
    "imprint": "Impressum",
    "privacy": "Datenschutz",
    "contact": "Kontakt",
    "text": "Hi, ich bin Manuel. Auf meiner Website dreht sich alles um Laufen, Reisen um die Welt, um Webentwicklung mit JavaScript und Node.js und natürlich auch um mich. Wenn du hier gelandet bist, solltest du lieber wieder weiter nach oben scrollen und wie vielen weiteren Seite der Website ansehen. Hier geht's nicht weiter.",
    "rightsReserved": "Alle Rechte vorbehalten.",
    "mwl": [
      "Mit viel",
      "in München entwickelt."
    ]
  },
  "socials": {
    "mail": "E-Mail"
  },
  "cookie": {
    "text": [
      "Meine Website verwendet Cookies, um die Nutzungserlebnis zu verbessern. Durch das Verwenden meiner Website stimmst du der Nutzung zu."
    ]
  }
}
